# if True:   #true条件成立
#     print('条件成立执行的代码1')  #不仅仅是print输出，代表一行执行代码
#     print('条件成立执行的代码2')
#
# print('我是无论条件是否成立都会执行的代码')

# true和false的界定：
# 1.任何非零和非空的对象都为真，解释为true
# 2.数字0.空对象.None对象,解释为false
# 3.判断的返回值为false和true

# # 用户输入一个变量
# age=int(input('你的年龄：'))
# #判断是否
# if age>=18:
#     print('不可以上网吧')
# else:
#     print('回家')

# ----------------------------------------------------------------------------------
# 比较运算符
# ==等于   ，!=不等于   ,<小于   ,> 大于   ,<=小于等于   ,>=大于等于

# a=5
# b=10
# if a>b:
#     print('true')
# else:
#     print('false')

# ---------------------------------------------------------------------------------------
# if进阶
# else一般用在最后，即所有条件都不满足时使用
# elif else 必须和if连系使用，不能单独使用

# age=int(input("你的年龄："))
# if age<16:
#     print("未成年")
# elif age >=16 and age <=18:
#     print("即将成年")
# else:
#     print("成年")

# 符合多个条件时，只会执行第一个符合条件的代码块
# a=6
# if a<7:
#     print("1")
# elif a<28:
#     print("2")
# else:
#     print("3")

# 成绩练习
# a=float(input("请输入你的成绩："))
# if a>=90 and a<=100:
#     print('A')
# elif a>=80 and a<90:
#     print('B')
# elif a>=70 and a<80:
#     print('C')
# elif a>=0 and a<70:
#     print('D')
# else:
#     print('成绩无效')

# ----------------------------------------------------------------------
# if嵌套应用场景：在之前条件满足的情况下，再增加额外的判断
# 同层级的if和else同缩进。

# 火车站验票安检事例
# has_ticket=True  #有车票
# knife_length=30  #定义刀长
# if has_ticket:
#     print('有车票，开始安检')
#     if knife_length<=20:
#         print('安检通过')
#     else:
#         print('🔪不允许带上车')
# else:
#     print('无车票，不允许通过')



































