# 一.类型转换
# python3 有六大标准数据类型
# Number 数字：int  float  bool  complex
# String 字符串
# List 列表
# Tuple 元组
# Set 集合
# Dictionary 字典

# 类型转换的特性：你想要获取什么的类型，就用什么样的函数
# str() 把其他数据类型转换为字符串
# a=5
# print(type(a))     #<class 'int'>
# b=str(a)
# print(type(b))     #<class 'str'>

# # tuple()  把其他数据类型转换为元组
# list1=[1,2]
# print(tuple(list1))   #(1, 2)
# print(type(tuple(list1)))  #<class 'tuple'>

# # list()  把其他数据类型转换为列表
# t1=(1,2)
# print(list(t1))   #[1, 2]
# print(type(list(t1)))  #<class 'list'>

# # dict()  转换为字典
# a=['a1','a2','a3','a4']
# b=['b1','b2','b3']
# d=zip(a,b)  #用zip把两个列表进行打包绑定，然后再转换成字典
# print(d)   #<zip object at 0x0000024E78A36680>   返回的是对象地址
# print(dict(d))

# =============================================================================
# 二.深浅复制
# 什么是传递引用
# 变量的定义  赋值
# a=10
# b=10
# print(id(a))  #id(a)查看a的内存地址  140728703653936
# print(id(b))  #id(b)查看b的内存地址  140728703653936
# 当两个变量的数值相同时，他们共用一个存放数值的内存空间
# 也就是b没有重复去存放10这个数据，而是引用了a的内存地址。即b=10的指针实际上是指向了a的内存地址。——好处：节省内存空间

# 定义列表
# a=[1,2,3,4]
# b=a   #赋值操作时，b引用了a的存储的内存地址，没有做数据的重复存储
# print(id(a),id(b))   #1875631099328 1875631099328

# -------------------------------------------------------------------
#拷贝
import copy  #导入copy模块
a=[1,2,3,4,5]
a_copy=copy.copy(a)  #复制a的信息
print(a_copy)   #[1, 2, 3, 4, 5]
print(id(a),id(a_copy))  #2984926662208 2984926604928
# 拷贝后内存地址不同，这是和引用的区别



















