# 递归函数的特性：
# 1）必须有一个明确的结束条件
# 2）每次进入更深一层递归时，问题规模相比上次递归都应有所减少
# 3）相邻两次重复之间有紧密的联系，前一次为后一次做准备
# 4）递归效率不高，递归层次过多会导致栈溢出
# 5）优点：定义简单，逻辑清晰

# 递推：给递归实现拆解，递归每一次都是基于上一次进行下一次的执行
# 回溯：遇到终止条件之前，从最后往回返，一级一级的把值返回来

# 累计和
# 求1-100 求和  用for
# sum=0
# for i in range(1,101):
#     sum+=i
# print(sum)

# 用函数
# def funa(n):
#     sum=0
#     for i in range(1,n+1):
#       sum+=i
#     print(sum)
# funa(3)

# 递归函数
# 求n项和
# 必须设置初始值，否则容易栈溢出
# def funb(n):   #funb(n)表示n项和
#     if n>0:
#         return funb(n-1)+n    #funb(n-1)表示n-1项的和
#     else:
#         return 0
# funb(3)

# 递归过程
# f(3)
# =f(2)+3
# =f(1)+2+3
# =f(0)+1+2+3     # 要f（0）设置一个初始值    return 0-----f(0)=0

# 用递归函数求斐波那契数列  1，1，2，3，5，8.....
#后一项的值=前两项和

def f(n):
    if n>1:
        return f(n-1)+f(n-2)
    else:
        return n
li=[]
# 输出1-10项
for i in range(1,21):
           li.append(f(i))
print(li)





