# 集合的定义：大括号包含元素，每个元素用逗号隔开
#与字典的区别：字典键值对一一对应关系，集合是没有的
# 举例
# s1={10,20,30}
# print(type(s1))    #<class 'set'>
# print(s1)          #{10, 20, 30}
#
# # 定义：用set()
# s2=set('asd')
# print(type(s2))   #<class 'set'>
# print(s2)         #{'a', 'd', 's'}
#
# # 定义一个空集合
# s3={}    #系统认为这是定义一个空字典
# print(type(s3))  #<class 'dict'>
#
# s4=set()      #定义一个空集合
# print(type(s4))   #<class 'set'>

# 集合的特性：无序不重复的数据类型，不支持下标操作

# ===================================================================
# 集合的常见操作
# 一.增
# 1.add
# s1={10,20}
# s1.add(100)    #{100, 10, 20}
# print(s1)
#
# s1.add(10)
# print(s1)    #{100, 10, 20}    自动去重

# 2.update()  追加的数据必须是可迭代的对象（列表，字典，集合，元组）
# s1={10,20}
# s1.update(100)
# print(s1)    #'int' object is not iterable  整形对象不是可迭代对象

# # 添加列表
# s1={10,20}
# s1.update([100])    #[100] 类型为列表，是一个可迭代对象
# print(s1)          #{100, 10, 20}
#
# #添加元组
# s1={10,20}
# s1.update((22,11))
# print(s1)
#
# #添加集合
# s1={10,20}
# s1.update({100})
# print(s1)
#
# # 添加字典
# s1={10,20}
# s1.update({22:33})   #只添加了key
# print(s1)            #{10, 20, 22}


# 把x和y合并，并且去重
# x={'apple','banana','cherry'}
# y={'google','apple'}
# x.update(y)
# print(x)

# 二.删除
# 1.remove()   删除集合中指定的元素，如果数据不存在则报错
# s1={10,20}
# s1.remove(10)
# print(s1)     #{20}

## 2.discard()丢弃  删除集合中指定的元素，如果数据不存在 不会报错
# s1={10,20}
# s1.discard(10)
# print(s1)      #{20}
# s1.discard(10)
# print(s1)      #{20}

# # 3.随即删除集合中的数据，并返回这个数据
# s1={1,2,3,4,5,6,7,8,9,0}
# del_num=s1.pop()
# print(del_num)     #0  返回的是删除元素
#
# # 3.交集 &
# a={1,2,3}
# b={3,4,5}
# se=a&b
# print(se)    #{3}
#
# #4.并集  |
# a={1,2,3}
# b={3,4,5}
# se=a|b
# print(se)   #{1, 2, 3, 4, 5}










