# 模块的使用
# import 模块名
# 步骤：1）创建模块（文件）---自定义模块
#      2）导入模块
#      3）使用模块里的内容时（如变量、函数名、类名等）--- 模块名.

# 例一：调取a.py
# import a
# print(a.s)

# ----------------------------------------------------------------------
# 模块取别名
# 应用场景：模块名较长时，可以取别名
# import a as t
# print(t.s)

# --------------------------------------------------------------------------
# 导入多个模块
# import os
# import sys
# import json

# -----------------------------------------------------------------------------
# from import
# from 模块名 import 函数名1（或属性），函数名2（或属性）
# from a import funa()
# funa()

# from import 与 import 区别：
# import random
# print(random.randint(1,5))
#
# from random import randint
# print(randint(1,5))

# -----------------------------------------------------
# py文件的两种功能
# 1.脚本：一个文件就是整个程序，直接运行
# __name__=='__main__'  表示代码是直接在当前文件里运行的
# def funa():
#     print(__name__)    #__main__
# funa()

# 2.模块：做为模块导入其他文件执行
# 作为模块导入时，__name__==模块名（没有后缀）
